{"pages":[{"text":"EDUCATION UNIVERSITY OF WISCONSIN - MADISON , WI (2008 – 2013) Ph.D in Chemical Engineering Advisor: Prof. Juan J. de Pablo GPA : 3.82/4.0 GRE : Analytical 800/800 Dissertation Thesis: \"Energy Landscapes in Proteins and Glasses\" 11 publications in the highest profile journals including Nature Materials and Nature Chemistry INDIAN INSTITUTE OF TECHNOLOGY ( IIT ) KANPUR , India (2004 – 2008) Bachelor of Technology in Chemical Engineering GPA : 8.9/10.0 B.Tech. Project: \"Case study on tubular reactor hot-spot temperature control for throughput maximization\" WORK AND RESEARCH EXPERIENCE INTEL CORPORATION , Hillsboro, OR RET Design Engineer (2013 – present) Developed models and algorithms to perform layout correction for high resolution reproduction of wafers Designed algorithms for high resolution mask development for interconnect VIAs for 14 nm &10 nm technology DEPARTMENT OF CHEMICAL & BIOLOGICAL ENGINEERING , UW - MADISON , WI Research Assistant (2008 – 2013) Discovered an entirely new class of materials – ultra-stable glasses with enhanced mechanical properties; discovery was featured in major news outlets including Materials Views , Phys.org , Materials360 and Red Orbit . Developed novel simulation schemes to study physical vapor-deposition of small organic molecules. Developed a molecular level theory to explain the formation and the enhanced mechanical properties of ultra-stable glassy materials by physical vapor deposition. Developed tools to calculate theoretical infrared spectra, in collaboration with experimentalists to interpret experimental data and to accurately understand conformational changes that occur during protein aggregation Discovered mechanisms of diabetic protein aggregation, leading to insights into new class of drugs for type- II diabetes; discovery was featured in major news outlets including C&E News and Nature Chemistry Presented research work at more than 10 international conferences and workshops Teaching Assistant (2009 – 2010) Graduate level thermodynamics: Taught statistical mechanics and thermodynamics to graduate students Senior year undergraduate process control and design: Oversaw experimental laboratory work RELIANCE INDUSTRIES LIMITED , Jamnagar, India Summer Intern (May 2007 – July 2007) Collaborated with engineers to reduce the down-time of the plant hydrogen-separation columns by 10 times Applied six sigma principles to analyze the efficiency of various separation processes in the naphtha plant Developed a phase diagram of ammonium chloride-based impurities in the upstream of the hydrogen-separation column in the aromatics units of the refinery HYTECH PROFESSIONALS , Noida, India Summer Intern (May 2005 – July 2005) Developed and documented a secure online Java-based tiff and pdf image viewer AWARDS & HONORS International student academic achievement award, UW -Madison, 2012 University of Wisconsin-Madison chemical engineering graduate student fellowship, 2008 Best B.Tech. Project award in the chemical engineering graduating class of 2008, IIT Kanpur Ranked 2 nd of 52 in the graduating class of 2008, IIT Kanpur Ranked among top 0.5% of 350000+ students in nation-wide IIT entrance examination, 2004 LEADERSHIP ROLES AND ACTIVITIES DE PABLO RESEARCH GROUP , UW - MADISON , WI System Administrator (2009 – 2013) Managed group of 30 users and developed policies for optimal utilization of 6000-core computing facility Increased utilization of computing facility from 30% to 100% over last 2 years by designing new tools & policies Founded and led a management team for solving user problems and for planning future investments Oversaw a tripling of the computing facility size, justified by research on efficient resource management Mentor (2009 – 2013) Founder and leader of protein research interdisciplinary group, now comprising 30 students from 4 labs Mentored multiple graduate students in advanced programming and molecular simulation methods Founded Journal Club to discuss advancements in molecular modeling; led to publications of novel algorithms Received highest performance ratings from students for teaching graduate level thermodynamics courses Student leader of interdisciplinary vapor-deposited glass research group comprising 20 researchers from 3 labs TECHKRITI NATIONAL TECHNICAL FESTIVAL , IIT KANPUR , India Coordinator (2006 – 2007) Organized software events at national technical festival with 5000+ participants Launched national-level competitions in mobile game programming and instant programming language learning Secured sponsorships from top tech companies in the country, leading to doubling of the program budget DEPARTMENT OF CHEMICAL ENGINEERING , IIT KANPUR , India Group Leader (2004 – 2008) Counseled underperforming students, improving GPA on average by 3/10 grade points Lead a team to manage a computer center of the residence hall of 500+ students Member of National Cadet Corps ( NCC ), IIT Kanpur division, India SKILLS Computational Programming Languages: C, C++, Objective C, Swift and JAVA Scripting: Perl, Python, Bash, Markdown, Matlab/Octave and Mathematica Molecular Simulations: GROMACS , LAMMPS , CHARMM , AMBER , HOOMD and Gaussian Chemical Engineering Tools: Aspen, Aspen Dynamics, Hysys, Fluent and Gambit System Administration: High-throughput computing ( HTC ), PBS and Condor Operating Systems: Linux, Mac and Microsoft Windows Web Development: HTML , Javascript, CSS and php Miscellaneous: MPI , OPENMP , CUDA , Machine Learning, Latex, Microsoft Office Experimental Protein Folding: protein purification, in vitro transcription and translation, PCR amplification Photolithography: spin coating, soft & hard baking, developing and etching Characterization Techniques: dynamic light scattering, differential scanning calorimeter, and rheometry Languages English (fluent), Hindi (native) and Bengali (conversational) PROFESSIONAL SOCIETIES American Institute of Chemical Engineers (AIChE) American Physical Society ( APS ), and Division of Polymer Physics( DPOLY ) Biophysical Society ( BPS ) PERSONAL Volunteer Developed and taught intensive summer program with courses in computer chip manufacturing for high school students from disadvantaged backgrounds as part of the UW -Madison PEOPLE program Taught software programming to high school seniors and college freshmen Interests Traveling to new places, Cooking, Photography, Running, Badminton, Tennis PUBLICATION & CONFERENCES Journal Publications Singh, S. , Ediger, M. D., and de Pablo, J. J., \"Ultrastable glasses from in silico vapour deposition\", Nature Materials , DOI : 10.1038/nmat3521, 2013. Singh, S. , Chiu, C.-c., Reddy, A. S., and de Pablo, J. J., \"α-helix to β-hairpin transition of human amylin monomer\", Journal of Chemical Physics , 138, 155101, 2013. Chiu, C.-c., Singh, S. , and de Pablo, J. J., \"Effect of proline mutations in pramlintide on the monomer conformations of human amylin\", BioPhysical J. , 105, 1227-1235, 2013. Singh, S. , Chiu, C.-c., and de Pablo, J. J., \"Efficient free energy calculation of biomolecules from diffusion-biased molecular dynamics\", Journal of Chemical Theory and Computation, 8 (11), 4657-4662, 2012. Singh, S. , Chopra, M., and de Pablo, J. J., \"Density of states-based molecular simulations\", Annual Reviews of Chemical and Biological Engineering , 3, 369-394, 2012. Middleton, C. T., Marek, P., Cao, P., Chiu, C.-c., Singh, S. , Woys, A. M., de Pablo, J. J., Raleigh, D. P., and Zanni, M. T., \"Two-dimensional infrared spectroscopy reveals the complex behalfaviour of an amyloid fibril inhibitor\", Nature Chemistry , 4, 355-360, 2012. Singh, S. , Chiu, C.-c., and de Pablo, J. J., \"Flux tempered metadynamics\", J. Stat. Phys. , 145, 932, 2011. Singh, S. , and de Pablo, J. J., \"A molecular view of vapor deposited glasses\", Journal of Chemical Physics , 134, 194903, 2011. Wang, L., Middleton, C. T., Singh, S. , Woys, A. M., Skoff, D., Raleigh, D. P., de Pablo, J. J., Zanni, M. T. and Skinner, J. L., \" 2DIR spectroscopy of human amylin fibrils reflects stable β-sheet structure\", Journal of American Chemical Society , 133 (40), 16062, 2011. Reddy, A. S., Wang, L., Singh, S. , Ling, Y. L., Buchanan, L., Zanni, M. T., Skinner, J. L. and de Pablo, J. J., \"Stable and metastable states of human amylin in solution\", Biophysical Journal , 99(7), 2208-16, 2010. Singh, S. , Lal, S. and Kaistha, N., \"Case study on tubular reactor hot-spot temperature control for throughput maximization\", Industrial & Engineering Chemistry Research , 47(19), 7257-7263, 2008 Conferences Singh, S. , Averett, D., Chiu, C.-c., Ediger, M. D., and de Pablo, J. J., \"Molecular modeling of ultra-stable vapor deposited glasses\", American Physical Society Annual Meeting , Boston MA (2012). Chiu, C.-c., Singh, S. , and de Pablo, J. J., \"Effect of lipid bilayer on human islet amyloid polypeptide self -assembly\", American Physical Society Annual Meeting , Boston MA (2012). Singh, S. , Chiu, C.-c., and de Pablo, J. J., \"Molecular characterization of dimerization of human amylin peptide in solution\", American Institute of Chemical Engineers Annual Meeting, Minneapolis, MN (2011). Hoffmann, K.Q., Singh, S. , Chiu, C.-c., and de Pablo, J. J., \"Structures of human amylin in the presence of lipid bilayers\", American Institute of Chemical Engineers Annual Meeting, Minneapolis, MN (2011). Singh, S. and de Pablo, J. J., \"A molecular view of vapor deposited glasses\", Gordon Research Conference: Chemistry and Physics of Liquids , Holderness School, NH (2011). Singh, S. and de Pablo, J. J., \"Strategies to counter aggregation of human amylin in solution\", 1st Les Houches school in computational physics: soft condensed matter , Le Houches, France (2011). Singh, S. , Chiu, C.-c., and de Pablo, J. J., \"Early stage aggregation studies of diabetic amyloid in solution\", American Physical Society Annual Meeting , Dallas TX (2011). Singh, S. , Chiu, C.-c., Hoffmann, K. Q., Reddy, A.S. and de Pablo, J. J., \"Early stage aggregation studies of diabetic amyloid in solution and membranes\", Biophysical Society Annual Meeting, Baltimore, MD (2011). Singh, S. , Reddy, A.S. and de Pablo, J. J., \"Misfolding of diabetic amyloid in solution\", American Institute of Chemical Engineers Annual Meeting , Salt Lake City, UT (2010). Singh, S. , Averett, D., and de Pablo, J. J., \"Molecular modeling of a stable glass - the case of trehalose\", American Physical Society Annual Meeting , Portland, OR (2010). Singh, S. , Chiu, C.-c., Hoffmann, K. Q., Reddy, A.S. and de Pablo, J. J., \"Aggregation of diabetic amyloid at biological interfaces\", MRSEC Midwest Symposium , Minneapolis, MN (2010). Singh, S. , and de Pablo, J. J., \"Molecular modeling of physical vapor deposited stable glasses\", Confinements at the nano-scale in polymers, 2nd Forum PRIMME , Poitiers, France (2009).","tags":"About","loc":"http://sadanand-singh.github.io/my-cv","title":"Sadanand Singh"},{"text":"","tags":"Machine Learning","loc":"http://sadanand-singh.github.io/MLandStat","title":"Training Robots - I"},{"text":"Problem Statement: The owner of an apple plantation has a monkey. He wants to transport his 10000 apples to the market, which is located after the forest. The distance between his apple plantation and the market is about 1000 kilometer. So he decided to take his monkey to carry the apples. The monkey can carry at the maximum of 2000 apples at a time, and it eats one apple and throws another one for every kilometer it travels. What is the largest number of apples that can be delivered to the market? Please give your solutions in the comments below. SOLUTION If the owner lets the monkey carry apples all the way to the end of the forest, in the first trip itself, all of 2000 aplles will be lost and the monkey will never return back, as the monkey will be out of any food and play. Lets approach this in a different way. Lets break the monkey's journey by per unit distance. To carry 10000 apples for 1 km, monkey has to make 2 x 5 - 1 = 9 trips! On each trip, the owner will loose 2 apples. Hence, for each km distance travelled untill number of apples is greater than 8000, monkey requires 9 x 2 = 18 apples. So, distance travelled by monkey until number of apples is less than 8000 is int(2000 / 18) + 1 = 112 km, and by this time, 10,000 - 112 x 18 = 7984 apples are left. Similarily, until 6000 apples are left, the monkey will require 2 x 4 - 1 = 7 trips for every km. Hence, the total distance travelled until no. of apples left is less than 6000 is 112 + int(2000 / 14) + 1 = 255 km, and by this time no. of apples left is 7984 - 143 x 14 = 5982. Now proceeding in a similar manner, until 4000 apples are left, the monkey will require 5 trips for each km. Total distance travelled until no. of apples left is less than 4000 is 255 + int(2000/10) = 455 km. By this time, number of apples left is 5982 - 200 x 10 = 3982. Until 2000 apples are left, the monkey will require 3 trips per km travelled. Total distance travelled till this time is 455 + int(2000/6) + 1 = 789 km. By this time, no. of apples left is 3982 - 334 x 6 = 1978. Below 2000 apples, the mokey will require only one trip to reach to market. Distance left is 1000 - 789 = 211 km. Number of apples required by the monkey to travel this distance is 211 x 2 = 422. Hence, total number of apples that can reach the market is just 1978 - 422 = 1556! That's just 15.56% of all apples. That's quite bad monkey. Moral of the story is, avoid dealing with fools :) Thank you all who tried this. Disclaimer: This puzzle has been inspired by a problem at the Blog on Technical Interviews.","tags":"Puzzle","loc":"http://sadanand-singh.github.io/ConsumeTransportProblem","title":"Puzzle 2"},{"text":"Here is the first puzzle. A man needs to go through a train tunnel to reach the other side. He starts running through the tunnel in an effort to reach his destination as soon as possible. When he is 1/4th of the way through the tunnel, he hears the train whistle behind him. Assuming the tunnel is not big enough for him and the train, he has to get out of the tunnel in order to survive. We know that the following conditions are true. If he runs back, he will make it out of the tunnel by a whisker. If he continues running forward, he will still make it out through the other end by a whisker. What is the speed of the train compared to that of the man? Please give your solutions in the comments below. Disclaimer: This puzzle has been copied from a Blog on Technical Interviews.","tags":"Puzzle","loc":"http://sadanand-singh.github.io/TrainSpeedProblem","title":"Puzzle 1"},{"text":"This is Sadanand Singh . I am a process engineer, a physicist, a programmer, an Indian and a human being; with interests in world politics, economics, and society. This space is for my personal notes on different subjects. I plan to share my thoughts on following topics from time to time. Technology Statistics Machine Leanrning News Economics Education Politics, Society & Education Indian Food Puzzles If you have interests in any of these topics, you are welcome to have a peek into my world. Please drop me your views through comments or any of the social media links. HAPPY WEB SURFING !!!","tags":"News","loc":"http://sadanand-singh.github.io/First Post","title":"Welcome to My World"}]}